espressif/esp-idf/components/soc/esp32c2/include/soc/spi_reg.h
#define SPI_SLAVE1_REG(i)          (REG_SPI_BASE(i) + 0xE4)
/* SPI_SLV_LAST_ADDR : R/W/SS ;bitpos:[31:26] ;default: 6'd0 ; */
/*description: In the slave mode it is the value of address..*/
#define SPI_SLV_LAST_ADDR    0x0000003F
#define SPI_SLV_LAST_ADDR_M  ((SPI_SLV_LAST_ADDR_V)<<(SPI_SLV_LAST_ADDR_S))
#define SPI_SLV_LAST_ADDR_V  0x3F
#define SPI_SLV_LAST_ADDR_S  26
/* SPI_SLV_LAST_COMMAND : R/W/SS ;bitpos:[25:18] ;default: 8'b0 ; */
/*description: In the slave mode it is the value of command..*/
#define SPI_SLV_LAST_COMMAND    0x000000FF
#define SPI_SLV_LAST_COMMAND_M  ((SPI_SLV_LAST_COMMAND_V)<<(SPI_SLV_LAST_COMMAND_S))
#define SPI_SLV_LAST_COMMAND_V  0xFF
#define SPI_SLV_LAST_COMMAND_S  18
/* SPI_SLV_DATA_BITLEN : R/W/SS ;bitpos:[17:0] ;default: 18'd0 ; */
/*description: The transferred data bit length in SPI slave FD and HD mode..*/
#define SPI_SLV_DATA_BITLEN    0x0003FFFF
#define SPI_SLV_DATA_BITLEN_M  ((SPI_SLV_DATA_BITLEN_V)<<(SPI_SLV_DATA_BITLEN_S))
#define SPI_SLV_DATA_BITLEN_V  0x3FFFF
#define SPI_SLV_DATA_BITLEN_S  0

#define SPI_CLK_GATE_REG(i)          (REG_SPI_BASE(i) + 0xE8)
/* SPI_MST_CLK_SEL : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: This bit is used to select SPI module clock source in master mode. 1: PLL_CLK_80
M. 0: XTAL CLK..*/
#define SPI_MST_CLK_SEL    (BIT(2))
#define SPI_MST_CLK_SEL_M  (BIT(2))
#define SPI_MST_CLK_SEL_V  0x1
#define SPI_MST_CLK_SEL_S  2
/* SPI_MST_CLK_ACTIVE : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to power on the SPI module clock..*/
#define SPI_MST_CLK_ACTIVE    (BIT(1))
#define SPI_MST_CLK_ACTIVE_M  (BIT(1))
#define SPI_MST_CLK_ACTIVE_V  0x1
#define SPI_MST_CLK_ACTIVE_S  1
/* SPI_CLK_EN : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to enable clk gate.*/
#define SPI_CLK_EN    (BIT(0))
#define SPI_CLK_EN_M  (BIT(0))
#define SPI_CLK_EN_V  0x1
#define SPI_CLK_EN_S  0

#define SPI_DATE_REG(i)          (REG_SPI_BASE(i) + 0xF0)
/* SPI_DATE : R/W ;bitpos:[27:0] ;default: 28'h2106070 ; */
/*description: SPI register version..*/
#define SPI_DATE    0x0FFFFFFF
#define SPI_DATE_M  ((SPI_DATE_V)<<(SPI_DATE_S))
#define SPI_DATE_V  0xFFFFFFF
#define SPI_DATE_S  0


#ifdef __cplusplus
}
#endif



#endif /*_SOC_SPI_REG_H_ */
